# Brewfile for Message Publisher Development Environment
# This file specifies system dependencies for macOS development

# Core development tools
brew "git"
brew "node"
brew "yarn"

# Development utilities
brew "wget"
brew "curl"
brew "jq"
brew "tree"

# Network tools
brew "netcat"
brew "nmap"

# Kafka (if you want to run Kafka locally)
brew "kafka"
brew "zookeeper"

# Optional: Database tools if your project uses databases
brew "postgresql"
brew "redis"

# Optional: Docker for containerized development
cask "docker"

# Optional: Development applications
cask "visual-studio-code"
cask "postman"
cask "tableplus"

# Optional: Terminal enhancements
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"